import {Injectable} from '@angular/core';
import {Http} from '@angular/http';

import {Observable} from 'rxjs/Observable';
import 'rxjs/Rx';

@Injectable()
export class Content {
  value = 'בשבילי';
  constructor(public http: Http) {
  }
  getData(key) {
      let data = {
  aboutPersonal: `<p><i>מתחילה תהליך? <a href="/assets/files/welcome.pdf" target="_new">הורידי כאן</a> את הערכה לפתיחת תהליך. מלאי את הערכה ושלחי אלי במייל.</i></p>
<p>תמיכה וליווי בדרך להריון אינה בגדר מותרות.
<br />
התהליך האישי יוצר עוגן במציאות המטלטלת של ההמתנה לילד.
<br />
התהליך לא בא במקום טיפול פיזי ולא מפריע לו. אדרבה, התהליך בא לתת בהירות, חיזוק האמונה שלך בגוף שלך ובכוחות הטמונים בך לצלוח את האתגר הזה.</p>

<h4>מה הקשר בין התפתחות אישית לבין כניסה להריון?!</h4>
<p>זו בדיוק השאלה שאני שאלתי את עצמי כשגיליתי את הקשר לראשונה! מסתבר שיש קשר. ומסתבר שזה עבד גם עלי וגם על נשים רבות שליוויתי וזכו להרות וללדת.</p>

<h4>איך זה עובד?</h4>
<p>בכל התחומים, ובייחוד בתחום הפוריות, הגוף והנפש עובדים ביחד. כל מה שקורה עם הגוף משפיע על הנפש
ולהיפך. לרוב, כאשר הזמן עובר הניסיונות להרות כושלים בזה אחר זה, הרגשות שממלאים אותך, משפיעים
מידית על הנפש שלך. היא נבהלת ומתכווצת ואז גם המקום לתקווה, אופטימיות, אמונה ושמחה נותר קטן
ומכווץ.
</p>
<p>תהליך ההתפתחות האישית בא לפתוח, לפרוץ ולהרחיב מה שצריך. התהליך נוגע באותו מקום פנימי של
הנפש, יוצר עבורה מרחב להשמיע רגשות, מחשבות ולבטא מה שהיא חווה. כל זה מאפשר לה לחזור לחיות
האמתית שלה, ליכולת זרימה ושחרור מופלאים מאין כמותם.</p>
<p>אז היא משפיעה על הגוף שגם חוזר לחיות, שחרור וזרימה.</p>
<p><span class="highlight">פתאום</span> רואים את המציאות אחרת</p>
<p><span class="highlight">פתאום</span> ההריון כבר לא נראה כל כך רחוק</p>
<p><span class="highlight">פתאום</span> ההריון כבר לא תופס את כל המקום במכלול החיים שלך</p>
<p><span class="highlight">פתאום יש חיים!</span></p>

<h4>מי מגיעה אלי לפגישות כיוון?</h4>
<p>כל אישה שרוצה להביא חיים חדשים לעולם וחווה תקיעות במקום הזה.
<br />
וכמו כן, אישה שמחפשת
זוגיות ומרגישה שהשעון הביולוגי שלה כבר בשלב מתקדם...</p>

<h4>מה מטרת פגישות הכיוון?</h4>
<p>נזהה את המקום החזק שלך ממנו את יכולה לעלות ולצמוח
<br />
נקבל בהירות לגבי הדרך שלך לצלוח את האתגרים העומדים לפתחך כרגע
<br />
נאפשר צמיחה והתחדשות בתחומים נוספים בחייך
<br />
נקשיב פנימה למחשבות הפוריות שלך וכן למחשבות החוסמות
<br />
נמיר את אותן מחשבות פוריות שבך גם לתחום הפוריות
<br />
נחווה את ההתקדמות בתודעה שלך ובמציאות חייך.</p>

<h4>כיצד מתנהל התהליך?</h4>
<p>התהליך מתנהל בביתי שבהוד השרון או דרך הטלפון, בשתי אפשרויות:
<ol>
<li>תהליך מלא בין 10-15 שיחות</li>
<li>הכוונה ראשונית 1-3 שיחות</li>
</ol>
לברר מה נכון לך, <a href="/contact">צרי קשר</a> ואחזור אליך בהקדם.</p>

<p><span class="highlight start">לתהליך חמישה שלבים<span כאשר כל שלב מכין אותך לשלב הבא.</p>

<p><span class="highlight">השלב הראשון</span> -  עולים על דרך המלך (המלכה!)
ראשית, "הצלחה פורייה"- נגלה מהו גורם ההצלחה שלך בחיים.
שנית, נזהה את החלום הפנימי שלך.
ואז - נתבונן יחד במפה הפורייה שלך, את המטרות שעומדות לפתחך, נזהה את ההתפתחות האישית שלך
בתוך האתגר הזה.
<br />
בסוף השלב הזה - את כבר תצאי עם בהירות לגבי תכנית העבודה הייחודית לך.
(השלב הראשון המלא – 3 פגישות)</p>

<p><span class="highlight">השלב השני</span> - תחילת החיבור בין גוף לנפש
בשלב הזה תזהי ותתחילי לעבוד עם הגוף בצורה שנכונה לך. במקביל, נזהה את המחשבות החוסמות
העומדות מאחורי הקושי, נקשיב ונמיר אותן במחשבות פוריות.</p>

<p><span class="highlight">השלב השלישי</span> - להסתכל על הדברים אחרת
בשלב הזה כבר תתחילי לחיות בתוך השינוי שנרקם. את תצליחי לראות על מה יש לך להודות ואת הייחודי בך
שאין לאף אחת אחרת.</p>

<p><span class="highlight">השלב הרביעי</span> - להיות פתוחה לקבל
בשלב הזה תצליחי לבטא החוצה וליישם בצעדים קטנים מה שכבר ראית.
בנוסף, בשלב הזה תראי עוד שינויים לטובה בחייך</p>

<p><span class="highlight">השלב חמישי</span> - סיכום התהליך</p>

<hr />

<p><span class="highlight">גם אם הדרך להיריון רצופת אתגרים, את רוצה לצעוד בשביל של שמחה, רוגע ושלמות עם עצמך.</span></p>

<!--<h1>תמונה שלי.. </h1>-->

<p><span class="highlight start">אני מאמינה</span> שלכל אישה יש את השביל שלה להגשמה ולהצלחה הפורייה שלה.</p>
<p>בכל אישה רצון החיים מפעם יחד עם כל כוחותיה.</p>
<p>לפעמים, שינוי קטן בתודעה ובהירות במקום שנראה תקוע</p>
יכולים ליצור זרימה גדולה תוך כדי מימוש הרצון הפורה.
<p>הרעיון במילה "בשבילי" בא מתוך מאמר חז"ל בסנהדרין:</p>
<p>"צריך כל אדם לומר, כל העולם לא נברא אלא <b>בשבילי</b>"</p>
<p><span class="highlight start">בשבילי</span> - צועדת בשביל שלי. האתגרים וההתקדמות שלי מדויקים לשביל זה של חיי.</p>
<p><span class="highlight start">בשבילי</span> - מגשימה את רצונותיי הכמוסים בשבילי, עבורי כדי למלא את תפקידי כראוי.</p>
<p><span class="highlight start">בשבילי</span> - המילה עולם מזכירה העלם. ההעלם והחוסר בחיי מדויק לי ואף נברא בשבילי.</p>
<p><span class="highlight">בכל אדם יש רצון עז לחיים. אצל אישה הרצון הזה אף גדול יותר מכיוון שבתוכה קיימת היכולת ליצור
חיים. כאשר אישה חווה את הקושי להביא חיים חדשים לעולם בדרך הרגילה והטבעית, היא חווה
תחושת חיסרון עמוקה.  החיסרון הזה הוא הזדמנות לצמיחה חדשה וגילוי חדש במסע חייה דרך
המוכנות להתבונן ולצאת אל המסע האישי – נשי של עצמה...</span></p>
<p>הצלחה בהגשמת מטרות ובחיים בכלל אינה בהכרח תוצאה של מאמץ, אלא של הדבר הנכון במקום
הנכון.  כאשר אנחנו עושים את ההתכוונות הראויה להיות מי שאנחנו באמת, הצלחה היא תוצאה
טבעית. מתוך התבוננות פנימית יהודית פתחי את התכונות והיכולות שבתוכך, את מי שאת כאדם,
ותצליחי.</p>

<p>לברר איזה תהליך נכון לך, <a href="/contact">צרי קשר</a> ואחזור אליך בהקדם!</p>

  `
      };
    return Observable.of(key ? data[key] : data);
  }
}
