import {Injectable} from '@angular/core';
import {Http} from '@angular/http';

import {Observable} from 'rxjs/Observable';
import 'rxjs/Rx';

@Injectable()
export class Content {
  value = 'בשבילי';
  constructor(public http: Http) {

  }

  getData(key) {
      let data = {
      songs: [{ id: "g1", type: "song", name: "סימנים", intro: `הייתי באמצע טיפול שנראה שלא ממש מתקדם, והיה נראה די תקוע. אבל משום מה, בתוך החיים, כתיבת הספר, עבודה אישית עם נשים, שיעורי פיתוח קול, הרצאות במקומות שונים, ההריון תפס מקום אחר. יצאתי מהתור והייתי שמחה. אמרתי לעצמי שזה סימן שאני בדרך הנכונה. ההריון כבר לא מנהל אותי אלא אני חיה! וגם יש בתוכי מקום לחיים נוספים! וכך יצא השיר הבא.`,
      words: `אלוקי,
אני מרגישה ומודה
אתה רואה
אתה שומע
רחשי שפתותי
אתה מבין
את מה שליבי
לוחש אליך
ממעמקיו

אלוקי
נתת לי סימן
לנוכחותך,
שארגיש שאתה
שומע את שיריי
ואני ראויה
בעיניך
זה דבר
 כה יקר בעיניי

סימנים
סימני אהבתך אלי
כל בוקר מחדש
סימני אהבתי
אליך
ולמציאותי

אני רואה את השגחתך ומודה
על כל רגע
ועל כל דקה
שאתה נושא אותי על כפיך
ברכות, באהבת עולם`},
      { id: "g2", type: "song", name: "הסופה / איך יכל כח הטבע", intro: `כשיצאתי עם בחור שהייתי בטוחה שיהיה בעלי וזה לא היה כך, הרגשתי שהמציאות מבלבלת אותי, מתישה ואני לא יודעת במה לאחוז כבר.. כתבתי את השיר הזה. דרכו הצלחתי לבטא את הטלטלה, להתמודד איתה ואפילו לדמיין את עצמי מתחזקת, מתרוממת ממנה.`,
words: `בעולם של הטבע
הרוח חופשיה
מערבלת, מערפלת,
מסחררת באופייה.

ואני, שבויה בקסם
של הרושם שיצרה,
מתערבלת, מתערפלת
אי שם בתוך מהמורה

מהלכת שם באילו
וחושבת מחשבות
מה היה קורה כאילו
כבר היו לי התשובות.

הסופה רק מתחזקת
ואותי כה מחלישה.
היא לרגע לא פוסקת,
את דרכי יותר מקשה.

והנה ידי אוחזת
בזהירות ובעוצמה
ובשנייה, שעוד פוחדת,
מחזיקה, מעצימה.

וביחד מרימות הן
את רוחה של הנשמה
שבתוכי הייתה גוועת
וכמעט שלא נשמה.
איך יכול כוח הטבע
לשטות בי עד בלי די?
איך יכולתי דרך קבע
לא להאמין למראה עיני?!
`},
      { id: "g3", type: "song", name: "אל המקום", intro: `אחרי בטא שלילית...  הרגשתי שכל עולמי חרב. אחרי שכאבתי, עיכלתי, הבנתי שצריך להמשיך הלאה התיישבתי לכתוב את השיר הבא יעזור לי להוציא החוצה את ההרגשה הפנימית שלי, לשחרר אותה לחופשי ולנסות להתמלא במשהו חדש, טוב יותר`,
words: `אל המקום חישבתי להגיע
מבלי שאתייגע כולי
בכמיהה כה גדולה לגעת
בכל המתהווה למולי.

הוויה מתעתעת,
מחשבה מזעזעת,
בדמיוני אני פוסעת,
עוד רגע ונוגעת.

ואיכה איגע ולא יגעתי
מה עוד אגלה טרם ידעתי
והיום יודעת אי שם מעדתי
משם נסתרות אני למדתי.

כל כולי אתפלל ולחש זעקה.
ליבי ונפשי ניחנו בשתיקה
וגופי לבדו אותת מצוקה,
בין בקשה לדרישה, נקודה השקה.`},
      { id: "g4", type: "song", name: "הרחוב הראשי", intro: `יום אחד חזרתי הביתה אחרי ששרתי לקול נגינת הפסנתר של חברתי. וכבר היה מאוחר בלילה אבל אני הייתי כל כך שמחה לבטא את כוחות היצירה והשירה שלי מתוכי. ממש דילגתי הביתה. ואז הגעתי לפנס רחוב גדול שבזכותו היה רחוב לאורך הכביש ומתוך השמחה והדממה יצא השיר הזה.`,
       words: `שירים שכתבתי, פועמת חולמת
על גבי ציר הזמן את עצמי ממקמת
על פי המילים את חיי מקיימת
התקווה בי נושמת, עודנה הולמת

על הרחוב הראשי אני פוסעת
ריק מאדם, השתיקה שלו נוגעת
בי, בנשמתי, במיתרי ליבי
אשר לא נגנו בי מעולם

וכעת, אותו רחוב סואן - בחשיכה לוטה
את אור הפנסים ברכות עוטה
ואני פוסעת, לבדי, בדממה.
מסביבי אין איש, גם הכביש מחריש
...
ורק עין אחת צופה

בחוץ די קריר
החיוך שלי מסגיר
את שמחה שבאויר
...
כי יש עין אחת צופה
`},
      { id: "g5", type: "song", name: "המתנה", intro: `נכנסתי בשעה טובה להריון ועוד לפני שהבטן כבר התחילה להתעגל היה לי חשוב לספר בעצמי לחברה טובה שגם היא מחכה לשלה... כמה ימים לפני לא הייתי שקטה עם עצמי.. איך היא תקבל את זה... ותוך כדי שהתחלתי לדמיין שאוטוטו גם היא, ויצא לי השיר הזה כעבור שנה גם היא נקלטה!`,
       words: `ואם המתנת ועוד לא בא
ודאי לכך ישנה סיבה
התבונני עמוק בפנים
ראי כמה עולמות נבנים

פתחי לו פתח בדקירה של מחט
למולך דלתו של אולם נפתחת
לא! אל תיסוגי לאחור
אולי זו עת שלא תחזור

אמרי בעוז אליו תפילה
ספרי לו כמה את יכולה
לפרוש כפייך אלי מעלה
ולקבל תשועה גדולה

בתי המתיני כי זו לך מתנה
את הכאב אצלך בלב רק את מבינה
ובשמחה שלך ישועתך נבנית
ובעוד שעה קלה הנה את נענית
`},
      { id: "g6", type: "song", name: "סובבת על עקביי", intro: `אחרי בדיקה מיוחדת שרופאת הפוריות שלחה אותי לעשות. לא רציתי לעשות אותה כי חשבתי שזה יהיה לחינם כי ברור לי שאין שם שום בעיה.. הייתי בטוחה שהתוצאה תהיה חיובית ופתאום היה הפוך לגמרי. לא יכולתי לראות שם עתיד. לא יכולתי לעשות אפילו צעד אחד קדימה, גם לא במחשבה. הבנתי שכאן, הכי נכון לי כרגע זה לעשות צעד חזרה אחורה ולהתכנס. הצעד הזה, בדיעבד כך הבנתי, היה צעד אל תוכי שאפשר לי להיות נוכחת איפה שאני גם אם מאד קשה שם. זה צעד שאפשר להסתכל בעיניים על המקום של בהווה ולקבל שזו המציאות כרגע ולהתחבר ל"כאן ועכשיו" שלי.`,
      words: `סובבת על עקביי
רצתי מהר מידי
בתוככי מחשבותיי
באשר חזו עיניי

למקומי שבתי
פעימה כה כבדה החסרתי
דמעתי מעיני מחיתי
הלוואי וכבר נושעתי

ענווה יקרה, אנא היכנסי!
 מלאי ביופייך את חיי, את כוסי
להשפיע עליי את טובך תנסי
יוהרה שבי ברוך תכסי

ה' אלוקיי, אמור לי אייכה
היגלה נא אליי שאראך, אודך.
חסר לי אותך, הראני טובך
נשמתי זועקת דורשת אליך
`},
{ id: "g7", type: "song", name: "לאן החיים לקחו אותך אשה", intro: `לפני הכל, אנחנו נשים.
אבל אי אפשר באמת לנתק את זה משאר החיים...
ואז יום אחד, בתוך העשייה המשפחתית, האישית, המקצועית
אני תופסת את עצמי יום אחד
עוצמת עיניים
אוהבת מה שאני רואה
אבל רוצה לקחת לרגע נשימה אחת ארוכה
ולהרגיש לאן כל המסע, המלא חיים הזה,
לוקח אותי.
ואותך?`,
words: `לאן החיים לקחו אותך, אישה,
אנה הרוח אותך ביקשה
עוצמת עינייך
חולמת על ים
לזרום ולצלול ולצוץ
מעל הזמן

לאן הילדים לקחו אותך, אישה
אל גן המשחקים
נדנדה, מגלשה
לאן את גולשת?
בין מה למה מתנדנדת?
מתיישב בארגז החול
יוצרת עוגות, בונה ארמונות
בשתי ידייך

לאן הלילות לקחו אותך, אישה
האם לאן שנפשך כל כך ביקשה
שובי אל האישה שבך
אל מקום עוטף, נעים ורך
אל הרחם הענקית
שתעטוף גם אותך
שתיתן לך מכוחות החיים שלה,
שלך.`
}
      ],
      stories: [
      {id: "y1", type: "story", name: "הכתום של הגזר - חלק א'", words: `היה זה היום הראשון ללימודים. כיתה א', מורה חדשה, חוויות חדשות. כל התלמידים החדשים בחרו את מקומם בכיתה. שלי ורבקה בחרו את מקומן בכתה גם כן, הם בחרו לשבת ביחד בדיוק מול המורה. שלי ורבקה לא חלקו רק את אותו שולחן, הם חלקו כמעט כל דבר אחר בחיים. אותו בניין, אותו צבע כתום אהוב, אותה תמונת ברבי המופיעה על ילקוטה של כל אחת מהן, והכי חשוב, הן חלקו את אותה חברות שהיתה להן, יחד.
השבועות הראשונים בבית הספר היו מוצלחים ביותר. המורה לימדה אותיות, חשבון ותורה. שלי ורבקה תמיד שמרו על אותה רמה ובכל יום אחר הצהריים היו מכינות שיעורי בית ביחד. כל שאר הילדות בכיתה התחילו לקנא בשתיים, גם הן רצו חברות טובה וחזקה שכזאת.

"אתן לא צריכות לקנא כלל!" טענה שלי כשהיא יושבת עם החברות האחרות בכיתה במהלך ההפסקה. "רבקה ואני מכירות אחת את השניה מאז שאנחנו תינוקות. אל תדאגו, עם הזמן אתן תצליחו ליצור חברות טובה כזאת!" באותו היום רבקה לא הגיעה ללימודים. נדיר היה למצוא את שלי ללא רבקה ולהיפך, וכשזה סוף כל סוף קרה הילדות ראו לנכון לנצל את ההזדמנות ולדבר עם שלי. הפסקה נגמרה, הפעמון צלצל והשיעור האחרון לאותו היום החל עם קולה הרם של מורה לטבע.

"היום אסביר על הפרויקט החדש שילווה אותנו במשך השנה," פתחה המורה ואמרה. שלי חשה את עיניה של המורה חולפות על פני כל הכיתה ולפתע נעצרות בה.השיעור המשיך.

"אני יודעת שאתם תעשו עבודה נפלאה!" המורה חייכה חיוך גדול ואוהב.

הפעמון צלצל וכעבור שניות אחדות הכיתה נותרה ריקה מאדם.`},
      {id: "y2", type: "story", name: "הכתום של הגזר - חלק ב'", words: `"באמת?!" שאלה רבקה בעיניים בורקות, "זה יכול להיות ממש כיף!"
      "כן, המשיכה שלי, "וכל שבוע עלינו להביא תמונה של שצמח שלנו ולדבר על הגדילה וההתפתחות שלו." היא נשמעה כמעט כמו המורה, מלאת ביטחון.
      "אבל יש בעיה, לנו אין חצר בבית כמו לכם" שלי הביעה דאגה, "היכן אוכל לשתול את הצמח שלי?"
      "אוי, אל תדאגי, את יכולה לשתול אותו בתוך אדנית." שלי ניסתה לעודד את רבקה למרות שידעה שלשתול צמח בחצר יהיה מוצלח יותר. כל אותו שבוע שלי ורבקה היו עסוקות בשתילת הצמחים שלהם. כרגיל, הן תכננו לשתול את אותו סוג צמח. הן תכננו לשתול גזר. "וכשהגזרים יגדלו," כך חשבו ביניהן, "נוכל להכין עוגת גזר ולהביא לכל הילדים בכיתה!"

בכל יום ביקרו ובדקו את השתילים הצעירים. בתחילה הם לא ראו דבר מלבד אדמה חומה וגומה במרכזה. קשה היה להתאזר בסבלנות אך לא היה להם מה לעשות בעניין מלבד להמתין. שלי, כמו רבקה, השקתה את שתיל הגזר שלה על פי הוראותיו של המוכר בחנות השתילים. "מתי כבר יהיה לי גזר כתום באמת?" מלמלה שלי לעצמה ערב לפני שיעור טבע.
        "שלי, יקרה שלי," אמה עמדה מאחור מלטפת את שערות ראשה, "זה לוקח זמן. ראשית הירוק של הגבעול גדל ואז נוכל לראות את הכתום של הגזר."
הכתום של הגזר... אמרה שלי לעצמה וצילמה את הערוגה החומה שעמדה במרכז החצר.

ביום שלמחרת כל הילדים הביאו את התמונות של הצמחים שלהם, או לפחות מה שאמור להיות צמחים בעתיד, והראו אותם למורה לטבע בחמש דקות האחרונות של השיעור. התמונות האחרות אינן שונות מהתמונה שלי, שלי חשבה בליבה והעיפה מבט בתמונה של רבקה. אני לא היחידה... הוקל לה.
כאשר צלצל הפעמון שלי ורבקה יצאו מהכיתה. בלכתן יחד הביתה תכננו כיצד ייראו תמונותיהן בשבוע הבא ואיך הן יכינו את עוגת הגזר שלהן.
         "הכיתה בטח תאהב את עוגת הגזר שלנו!" שלי אמרה לרבקה ושתיהן צחקו. "אני חושבת שכבר הלילה אראה את הגבעול הירוק בערוגה." המשיכה.
         "איך את יכולה להיות כל כך בטוחה בזה?" שאלה רבקה והביטה בשלי בתמיהה.
         "אני משקה אותו כל יום."
         "גם אני..."
         "יופי, אז אין לך מה לדאוג! אני כבר לא יכולה לחכות שיהיו לנו הרבה גזרים ונכין את העוגה!" שלי אמרה בהתלהבות, פתחה את דלת ביתה ונכנסה פנימה. רבקה עלתה במדרגות לקומה שמעל, נכנסה גם היא לביתה והלכה היישר אל החלון הגדול בסלון לראות את האדנית אשר ניצבה לה שם ולדמיין בה כמה גזרים קטנטנים.

ימים עברו, שלי ורבקה בחנו את הצמחים שלהם כמה פעמים ביום אך דבר לא קרה. לאחר מספר שבועות של המתנה הגבעול הירוק בצמחים של שלי ורבקה החל לגדול אמנם עדין לא היה ניתן לנחש שיום אחד זה הולך להיות גזר. רק שלי ורבקה, בציפייה גואה, חיכו לראות ולו רק גזר קטנטן שיקשט להם את התמונה במעט צבע כתום.

יומיים לפני שיעור הטבע בו כל הילדים מראים את התמונות, שלי שמעה קול צעקה מהקומה למעלה. היא מיד רצה לביתה של רבקה לראות מה קרה.
        "תסתכלי!" רבקה פקחה את עיניה הבורקות והצביעה על אדנית שלה בהתלהבות.
        "אני לא רואה כלום!" קבעה שלי באכזבה, "חשבתי שאת רוצה להראות לי משהו רציני..."
        "חכי, את לא רואה שם את הנקודה הכתומה שמבצבצת לה בצד השמאלי של הגבעול?" רבקה שאלה בשקט כמבקשת משלי להקשיב לה בדריכות. שאלה בחנה היטב את הצמח שוב, היא ראתה משהו קטנטן וכתום מנסה לפרוץ החוצה.
        "זה שום דבר. את צריכה לחכות למשהו רציני, וחוץ מזה, בתמונה, אף אחד לעולם לא יוכל להבחין בדבר כזה קטנטן!" שלי פנתה לביתה והשאירה את רבקה עצובה ומאוכזבת. מה אם זה באמת שום דבר ולעולם לא אראה את הגזר שלי גדל, רבקה תהתה לעצמה.

מה אם היא צודקת, שלי שכבה על מיטתה וחשבה, מה אם זה הולך להיות גזר קטן בקרוב...

שלי התעוררה מוקדם בבוקר ויצאה אל החצר לראות את הערוגה הקטנה שלה, דבר עדיין לא השתנה מאמש כשהיא בדקה את השתיל לאחר שחזרה מרבקה.
`},
      {id: "y3", type: "story", name: "הכתום של הגזר - חלק ג'", words: `כל הילדים הביאו תמונות חדשות של הצמחים שלהם.
      "האם ראיתם את התמונה הזאת, ילדים," המורה לטבע הפנתה את תשומת ליבם של כל הילדים אל תמונה אחת. היתה זו התמונה של רבקה. היא הרימה אותה בידה ואמרה "הצמח של רבקה כבר מתחיל לגדול. מי יכול להגיד לי מה רבקה שתלה באדנית שלה?"
      "גזר!" צעקו הילדים פה אחד ועיניהם נעוצות בתמונה. שלי השפילה מבטה עד שהפעמון צלצל וכולם הלכו הביתה.

הלוואי והגזר שלי יגדל! שלי לחשה על מיטתה לפני שאמרה 'קריאת שמע' שעל המיטה. למה הגזר של רבקה כבר מבצבץ החוצה ונגלה ושלי עדיין לא...? דמעה כבדה נפלה על פניה, אני לא אוהבת את הגזר של רבקה! הוא כל כך קטן ומכוער. וחוץ מזה, היא לא חברה טובה בכלל! אם היא היתה חברה טובה היא לא היתה מראה את התמונה עם הגזר הקטנטן שלה לאף אחד עד שגם שלי יצוץ החוצה. היא רק רוצה שאקנא. האם אני מקנאה? האם אני מקנאה ברבקה? לא... ואולי כן? איך יכול להיות? מה אעשה עכשיו? הגזר שלי חייב להתחיל לגדול! מה לא טוב בו? מה לא טוב בי? דמעות זלגו מעיניה אחת אחרי השניה והרטיבו מעט את הסדין. עיניה החלו להיעצם עד שנרדמה.
שלי המשיכה לבדוק את הערוגה הקטנה שלה כמה פעמים ביום וקיוותה שמשהו יקרה. יום אחד בדרכם הביתה, רבקה הזמינה את שלי אליה לראות את הגזר הגדל. שלי לקחה נשימה עמוקה ועלתה עם רבקה במדרגות.
       "זה ממש קטן," הפטירה שלי בנימה רצינית וקרה.
      תארי לך שזה היה אפילו יותר קטן מזה, זה גדל כל הזמן!" עיניה של רבקה שוב היו בורקות ומבטה היה זוהר. אך שלי לא הרגישה כך, עיניה היו כבויות ועצובות. הגזר של רבקה גדל עוד ועוד בתוך ימים אחדים. באותו הזמן, שלי המשיכה לבדוק את הגזר שלה, אך דבר לא קרה ושום כתום לא בצבץ לו החוצה. אני לא יכולה להביא תמונה מחר, חשבה בליבה ונגעה קלות בגבעול הירוק שעמד במרכז הערוגה, אם הילדים האחרים לא יראו את הגזר שלי צץ החוצה, הם ודאי יצחקו עלי ויגחכו לעצמם.

למחרת, אף ילד לא ראה את התמונה של שלי. היא הראתה אותה למורה ומיד אחר כך טמנה אותה בתוך התיק. בסוף היום שלי ורבקה הלכו יחד הביתה.
      "מה רצית לבקש ממני?" שלי שאלה את רבקה בדרך.
      "המורה ביקשה ממני להביא את האדנית שלי לכיתה בשבוע הבא," אמרה רבקה, "ורציתי לשאול אותך אם תסכימי לקחת אותה איתי עד לבית הספר, כי יהיה לי כבד מדי לסחוב אותה לבד."
      "בטח, למה לא?" שלי משכה את כתפיה ונהגה כאילו הכל כרגיל. היא לא רצתה שרבקה תבחין במשהו שאינו כשורה, למרות הכל היא לא רצתה לאבד חברה כמו רבקה. אבל בתוך תוכה הרגישה שלי שמחה ופחד יחדיו. שמחה לעזור לחברתה הטובה ופחד לעזור לחברתה להמשיך ולקבל את תשומת לב כל הילדים בכיתה.
`},
      {id: "y4", type: "story", name: "הכתום של הגזר - חלק ד'", words: `שבוע לאחר מכן, שלי עמדה על מיטתה, חסרת מנוחה.
       "אני לא רוצה ללכת היות לבית הספר!" בכתה.
       "למה? היום זה היום האהוב שלך? אמה שאלה ברכות.
       "כבר לא!" שלי מלמלה ופניה נהיו עצובות.
       "אבל אתמול בלילה צילמנו את הערוגה שלך. את תמיד נלהבת להראות את התמונה שלך למורה."
       אני לא רוצה לראות את התמונה הזאת ואני לא יכולה ללכת היות לבית הספר. הכי טוב בשבילי להישאר היום בבית," שלי התחילה לבכות, "בבקשה אל תכריחי אותי ללכת..."
       "לא אכריח אותך ללכת, אם זה מה שאת מרגישה. אבל את תרצי שאתן את התמונה למורה?"
       "לא איכפת לי..." אמרה שלי ונשכבה בחזרה על מיטתה.

       "שלי לא מרגישה כל כך טוב," אמא של שלי אמרה לרבקה כשראתה אותה מחכה מחוץ לבניין ואת האדנית הניצבת לידה. היא הבחינה בגזר הקטן. פתאום הבינה הכל ותכננה לדבר על כך עם שלי ברגע שתחזור.
       "שלי המסכנה, ובכן, אני יכולה להביא למורה את התמונה שלה, אם את רוצה." הציעה רבקה בנימה ידידותית.
      "זה יכול להיות רעיון נהדר" אמרה אמא של שלי והוציאה את התמונה מתיקה ונתנה אותה לרבקה.

כל הילדים שמו את התמונות שלהם על שולחנה של המורה לטבע. רבקה שמה שתי תמונות, את שלה ואת של שלי.
      "של מי התמונה הזאת?" המורה לטבע שאלה בקול רם את כל הילדים. רבקה הרימה את עיניה וזיהתה את החצר של שלי.
       "התמונה הזאת של שלי אבל היא לא יכלה לבוא כי היא לא מרגישה כל כך טוב.." רבקה ענתה בקול.
        "כמה חבל," אמרה המורה, "תגידי לה בבקשה להסתכל היטב על הערוגה שלה, אני רואה שמשהו מתחיל לזוז כאן..."
`},
      {id: "y5", type: "story", name: "הכתום של הגזר - סיום", words: `למרות שהאדנית שלה היתה כבדה, לאחר הצלצול האחרון באותו יום רבקה הלכה הביתה מהר ככל שיכלה, ממהרת לספר לחברתה הטובה, שלי, את החדשות הטובות.
       "שלום..." שלי פתחה את הדלת לרבקה וחשה מעט מבוישת, "באת להביא לי את שיעורי הבית של היום?" שאלה.
       "באתי להביא לך חדשות!" רבקה חייכה ופתחה את עיניה הבורקות.
מה עכשיו, שלי חשבה לעצמה והכניסה את רבקה לביתה. "לאן את הולכת?" שאלה שלי את רבקה שכבר יצאה במהירות אל החצר.
       "בואי! אני רוצה להראות לך משהו!"
שלי לא הבינה אבל היא באה. "מה את רוצה שאראה? זו רק אדמה חומה עם גבעול ירוק במרכזה."
       "לא, לא," רבקה הנידה ראשה לשלילה. "תסתכלי שוב היטב."
שלי התקרבה אל הערוגה והפעם בחנה אותה היטב וחיוך רחב השתחרר על פניה.
      "תיראי! הנה זה!" שלי הסתכלה על רבקה בעיניים בורקות ודמעות זלגו על לחייה. "הכתום של הגזר... הוא סוף סוף הגיע..."

שלי ורבקה חיבקו זו את זו. שלי חשה כמה שמחה היתה רבקה בשבילה. לפתע נעלמו כל הכעסים וכל התחושות הרעות. שלי הבינה שרבקה היא חברה טובה מאוד. שלי הבינה דבר נוסף, היא הבינה שכל דבר פשוט קורה בזמן שלו.
`}
      ]
        };
    return Observable.of(key ? data[key] : data);
  }

}
