import {Component} from '@angular/core';
import {NgFor} from '@angular/common';

@Component({
  selector: 'home',  // <home></home>
  // We need to tell Angular's Dependency Injection which providers are in our app.
  providers: [
  ],
  // Our list of styles in our component. We may add more to compose many styles together
  styles: [ ],
  // Every Angular template is first compiled by the browser before Angular runs it's compiler
  template: `<div class="page">

  <h3>ברוכה הבאה</h3>

  <p><span class="highlight">לאפשר להריון וללידה שלי להגיע אלי ללא תסכול ומתח</span></p>

<p><span class="highlight">להיות שמחה, רגועה ושלמה עם עצמי ועם אתגרי הפוריות שבחיי</span></p>

<p><span class="highlight">ככה אני חיה את חיי ובזכותו גם ילדתי, עד כה, את שלושת ילדיי</span></p>

<p><span class="highlight">וכך גם את יכולה לחיות ולהביא חיים!</span></p>

<p><span class="highlight start">אני זוכרת את הרגע בו הבנתי</span> שאני מחכה להריון שלא מגיע וזה משתלט לי על כל החיים.
לא ידעתי איך "לאכול" את זה והרגשתי בהמתנה מורטת עצבים וחוסר ודאות טוטאלי איך
ומתי זה יגיע. (אם בכלל...) הקושי התעצם ופתאום, לדבר שאמור להיות הכי פשוט וטבעי
מצטרפים עוד ועוד שותפים</p>

<h4>מה לא ניסיתי?</h4>

<p>ניסיתי טיפולים משלימים ורפואות שונות ומשונות, בכל אחת נתתי תקווה גדולה ואת מיטב
כוחותיי, כספי וזמני. אבל שום דבר לא באמת עזר. כשטיפולי הפוריות הקונבנציונליים לא
הצליחו, נשברתי. הרגשתי שאין לי במה לאחוז, ההתמודדות הפכה להיות אינטנסיבית יותר
ויותר מול כל חזית אפשרית - סביבה, משפחה, זוגיות, רופאים, הגוף שלי, מול עצמי
מעבר לקושי הפיזי של הטיפולים חוויתי קושי עם מה שחשבתי שזה מעיד עלי. כמו למשל,
שאני לא בסדר / אני לא נשית / יש בי מום / אני פגומה / אני לא ראויה.</p>

<h4>ההריון הראשון</h4>

<p>החיים המשיכו ודרשו את שלהם. אז הגעתי לנקודה בה אני חייבת להקדיש תשומת לב
לדברים נוספים בחיי כמו עבודה, זוגיות שפויה, מבחני גמר, עבודות הגשה, בריאות.
הכל הגיע בבת אחת ונאלצתי לשים לרגע בצד את ה"מארב" להריון המיוחל שלי למרות
שהמשכתי בטיפולי הפוריות. וממש אז, הריתי לראשונה.
תוך כדי ההריון הראשון, הצלחתי להסתכל בצורה רחבה יותר על מה עברתי עד כה וכתבתי
ספר בן 120 עמודים. הספר נגנז אבל אני הגעתי לכמה תובנות שהתחילו לחלחל לתוכי.</p>

<p><span class="highlight">הבנתי שתוך כדי המרוץ להיריון החיים שלי קפאו</span></p>

<p><span class="highlight">הבנתי שרציתי הריון אבל משהו בתוכי היה חסום וסגור</span></p>

<p><span class="highlight">הבנתי שאני תלויה בהיריון כדי להיות שמחה, שייכת ושלמה עם עצמי</span></p>

<p><span class="highlight">הבנתי שאני תלויה בהיריון שלי כדי להרשות לעצמי לפרוח בתחומים נוספים</span></p>

<p><span class="highlight">הבנתי שאני מעדיפה לרוץ מטיפול לטיפול מאשר לשמוע מה מתרחש בתוכי</span></p>

<p><span class="highlight">הבנתי שאני מפחדת מאיך ייראו חיי עד סוף גיל הפוריות.</span></p>

<p><span class="highlight start">אבל לא ידעתי מה לעשות עם כל ההבנות האלה.</span></p>

<p><span class="highlight start">ובטח לא איך ליישם אותן בחיים שלי!</span></p>

<p>כאשר שוב התעוררה כמיהה לילד נוסף, חזרתי למרוץ אל ההריון. שוב מיקדתי את כל
תשומת הלב על הטיפול הנוכחי, שוב חוויתי תסכול ואכזבה כשהוא נכשל, ניסיתי כל מיני
סגולות ותמיד אותה שאלה ריחפה מעלי: 'איך הנס הזה יקרה לי שוב? ואם בכלל?!' גם הייתי
מתוחה לקראת כל בדיקה או מעקב. כשטיפול משלים אחד לא צלח הייתי מיד בודקת טיפול
משלים אחר ומיד עושה מה שצריך. ובעצם, כל מה שעשיתי כדי להרות שוב לא נשא פרי.
הבנתי שאם ככה אמשיך, לא תהיה לי ברירה אלא להיות עוד יותר מתוסכלת,  מאוכזבת
מעצמי, מהמצב, מהגוף שלי וכמובן, להשאיר את החיים שלי במצב המתנה עד להריון הבא.
חיפשתי דרך ליצור את השינוי כל כך ייחלתי לו.</p>

<p><span class="highlight">ולאט לאט גיליתי!</span></p>

<p><span class="highlight start">עברתי תהליך</span> מופלא - נפשי וגופני גם יחד. למדתי לחיות ביחד עם אתגר הפוריות שלי
במקום במאבק מולו. הצלחתי לנהל חיים יצירתיים, פוריים ומספקים ובו זמנית לעבור טיפולי
פוריות בשמחה, ברוגע ובשלמות עם עצמי. בתוך התהליך הזה הרבה מאד דברים התחילו
לזוז בחיים שלי לכיוון טוב מאד - שוב זכיתי להרות וללדת והיום אני אמא גאה לשלושה ילדים מקסימים.</p>

<h4>מעבר להיריון זכיתי</h4>

<p>להפוך את מציאות חיי לפורייה ומספקת</p>

<p><span class="highlight">מבחינת היצירה שלי,</span></p>

<p>כתבתי ספר, שירים רבים ומאמרים
<br />
התחלתי לעבור עם ההרצאה שלי ברחבי הארץ
<br />
למדתי פיתוח קול והתחלתי לשלב את השירים שלי בהרצאה</p>

<p>מבחינה משפחתית</p>

<p>נהייתי הרבה יותר סבלנית וקשובה, רכה ומכילה</p>

<p><span class="highlight">מבחינת העשייה שלי</span></p>

<p>ליוויתי עשרות נשים בתהליכים אישיים בדרך למימוש הרצון שלהן בחיים
<br />
פתחתי סדנה נוספת לליווי נשים בדרך להריון
<br />
<p>גיליתי את השליחות שלי והצלחתי להפוך אותה לעיסוק העיקרי שלי – לעזור לנשים ליצור
<br />
ולממש את הרצון שלהן להביא חיים ולצלוח את אתגרי הפוריות ברוגע בשמחה ובשלמות עם עצמן</p>

<p><span class="highlight start">בעקבות ההצלחה שלי והחיים החדשים שחוויתי בעקבותיה בכל תחומי החיים אני שואפת גם לעזור לך!</span></p>

<p><span class="highlight">לנהל חיים יציבים ופוריים גם כשההיריון עדיין בדרך</span></p>

<p><span class="highlight">להיכנס לטיפולי הפוריות (כשצריך) מתוך רוגע וביטחון</span></p>

<p><span class="highlight">להאמין מחדש בגוף שלך והיכולת שלו להרות</span></p>

<p><span class="highlight">לאהוב את מציאות החיים שלך כפי שהיא</span></p>

<p><span class="highlight">להיכנס להריון קודם מהראש והתודעה</span></p>

<p><span class="highlight">להרגיש בנוח עם עצמך ועם הזוגיות שלך בכל מצב</span></p>

<p><span class="highlight">לשים קץ לכעס, לתסכול ולרגשי הנחיתות</span></p>

<p><span class="highlight">לשמוח בחלקך ללא השוואה לאחרות</span></p>

<h4>למה לי לעסוק בכל זה?!</h4>

<p>אז נכון, יש לי בית לנהל וילדים לטפל בהם ולא חסרה עבודה ואולי עדיף היה לי לעבוד
כשכירה. אז למה אני מסדרת לעצמי עוד פרויקטים? משום שמה שעוזר לי להיות אישה
פורייה, חיה חיים מלאי שמחה וסיפוק זה לעבור עם נשים אחרות תהליך שמצמיח אותן
ומאפשר להן לממש את הרצונות שלהן ולחיות את החיים שהן רוצות.</p>

<p>השיטה בה אני עובדת מבוססת על הניסיון שלי, הכישרון שקיבלתי במתנה לעבוד עם אנשים
ולהצמיח אותם מהטוב שלהם ועל שיטת כוונה וכלים של אימון יהודי אותם למדתי ב"מכללת
כוונה" והוכשרתי לכוון בתהליכים אישיים ולהנחות קבוצות.</p>

<h4>חלק מעקרונות השיטה:</h4>

<ul>

<li>עין טובה</li>

<p>בגישה של אימון יהודי הבסיס הוא מרחב של כף זכות שדרכו ניתן לגשת לכל התהליך מתוך ראייה שיש כאן רצון טוב, אדם טוב ומכוח הטוב צומחים יותר מהר ובקלות.</p>

<li>עקב בצד אגודל</li>

<p>השיטה מחשיבה גם את הדרך אל המטרה וגם את המטרה בעצמה. כך אנחנו לומדות להוקיר כל צעד קטן בדרך בלי להתפתות לצעדים גדולים ודרסטיים. לשמוח מעצם ההתקדמות.</p>

<li>שיתוף עמוק ושיתוף רוחבי</li>

<p>ההחלטה לצאת ממחבוא הבושה על ידי שיתוף אחרים מרחיבה את מעגל התמיכה שלנו מסביב.</p>

<li>להיות נוכחת ברגש</li>

<p>כשאת מרשה לעצמך לבכות כשעצוב וקשה, לשמוח כשטוב, ובכלל, לבטא כל רגש שעובר בפנים, בזמן ובמקום הנכון, את פורקת את המטענים שהצטברו בפנים ובכך לפנות מקום למשהו טוב.</p>

<li>הקשבה למחשבות הפוריות ולמחשבות החוסמות</li>

<p>נכיר את המחשבות הפוריות שלך והמחשבות החוסמות. כיצד הן מנהלות אותך וגורמות לך לפעול בצורה שבה את פועלת ולחשוב באופן בו את חושבת. נשים לב לשינוי שמתחיל לצמוח מתוכך דרך ההתפתחות האישית.</p>

<li>תקשורת זוגית נכונה – בתהליך נקבל כלים לבנות נכון עוגן זוגי, לחזק את הזוגיות ואת היכולת לתמוך אחד</li>

<p>בשני בזמן ההמתנה לילד, טיפולי הפוריות וכל הטלטלות.</p>

</ul>

<p><span class="highlight">אם גם את רוצה לחיות חיים פוריים ומספקים וגלות את הדרך שלך להרות בנחת ובשלמות עם עצמך, גם אם בעזרת טיפולי הפוריות <a routerLink="/contact">צרי קשר</a>!</span></p>

<p>שלך באהבה,</p>

<p>גלית</p>
</div>`
})
export class HomeComponent {
}
