import {Injectable} from '@angular/core';
import {Http} from '@angular/http';

import {Observable} from 'rxjs/Observable';
import 'rxjs/Rx';

@Injectable()
export class Content {
  value = 'בשבילי';
  constructor(public http: Http) {
  }
  getData(key) {
      let data = {
  aboutWorkshop: `

  <p><span class="highlight">דמייני</span> את עצמך עושה מה שנדרש ממך למען ההיריון המיוחל שלך ברוגע, ללא מתח, פחד ודאגות. מבלי לוותר על דברים שחשובים לך כמו הזוגיות שלך, השמחה שלך, המשפחה, חברים, ושאר תחומי החיים.</p>

  <p><span class="highlight start">כשנתקלת בקושי להיכנס להריון</span> וראית שכבר עובר זמן, התחלת מיד לטפל בבעיה הגופנית וכמה שיותר מהר. בין אם זה דרך רפואה טבעית, קונבנציונאלית ו/או תזונה וכושר, נתת את מלוא תשומת הלב לצד הגופני. זה אכן צעד טבעי וגם נכון. אבל, אי שם, הצד הנפשי התכווץ לו, נכנס לאיזו תיבה עמוק בתוכך. ובכל פעם שוב נדחק למטה שלא יישמע, שלא יצוץ...
  <br />
  <br />
  עכשיו, את מבינה שלקול הזה יש השפעה גדולה מאד על חייך ואת רוצה לתת לו מקום.</p>

  <h4>בנימה אישית...</h4>
  <p>כשעמדתי בעצמי מול ההתמודדות הזו, הגעתי למקומות נמוכים מבחינה נפשית חלק ניכר מתקופת ההמתנה לילד. רציתי להרגיש טוב, פשוט לשמוח ולא הצלחתי. הייתי נופלת כל פעם מחדש.
  <br />
  עם הזמן, בעזרת שליחים טובים בדרך ומוכנות גדולה שלי, עברתי עם עצמי תהליך שלם שאחריו כבר לא הייתי אותו אדם. עדיין ציפיתי וחיכיתי, עדיין טיפלתי אבל מיום ליום זה נעשה ממקום אחר, בחשיבה חדשה שאני בסדר כפי שאני,  שלמה עם עצמי, עם הגוף שקיבלתי. היום יש לי שלושה ילדים מתוקים, אני שמחה במה שיש לי ופתוחה לקבל עוד.
  <br />
  היום אני יודעת לשים את האמירות השונות מהסביבה במקום הנכון מבלי להיפגע. בזוגיות השיח בינינו הוא מתוך הבנה, קבלה ופתיחות.
  <br />
  בעקבות הניסיון שלי ולאחר ההכשרה המתאימה, כיום אני מכוונת נשים מול אתגרי הפוריות, מרצה ומנחת קבוצות.
  </p>
  <p>
  <span class="highlight start">גם את יכולה להגיע למקום הנפלא הזה!</span>
  </p>
  <p>
  בתהליך מסודר ומובנה ועדיין גמיש מספיק לעולם שלך את מקבלת ליווי תוך הקשבה מלאה לקול הפנימי שלך, באופן המדויק לך ולאורח החיים שלך. זהו תהליך שמבין אותך ומאפשר לך להביא את עצמך ללא שיפוטיות.
  <br />
  ההתמודדות מול הסביבה, המשפחה, הרפואה, בזוגיות ואפילו מול עצמך.
  <br />
  תהליך פנימי מובנה ייצור בך אדם חדש פיזית ונפשית. והשינוי הזה ישפיע לטובה על התוצאות במציאות. כולל תוצאות הטיפולים.</p>

  <h4>מה הקשר בין התפתחות אישית לבין כניסה להריון?!</h4>
  <p>זו בדיוק השאלה שאני שאלתי את עצמי כשגיליתי את הקשר לראשונה! מסתבר שיש קשר.
  <br />
  ומסתבר שזה עבד גם עלי וגם על נשים רבות שליוויתי וזכו להרות וללדת.
  <br />
  <strong>איך זה עובד?</strong>
  <br />
  בכל התחומים, ובייחוד בתחום הפוריות, הגוף והנפש עובדים ביחד. כל מה שקורה עם הגוף משפיע על הנפש ולהיפך. לרוב, כאשר הזמן עובר הניסיונות להרות כושלים בזה אחר זה, הרגשות שממלאים אותך, משפיעים מידית על הנפש שלך. היא נבהלת ומתכווצת ואז גם המקום לתקווה, אופטימיות, אמונה ושמחה נותר קטן ומכווץ.
  <br />
  תהליך ההתפתחות האישית בא לפתוח, לפרוץ ולהרחיב מה שצריך. התהליך נוגע באותו מקום פנימי של הנפש, יוצר עבורה מרחב להשמיע רגשות, מחשבות ולבטא מה שהיא חווה. כל זה מאפשר לה לחזור לחיות האמתית שלה, ליכולת זרימה ושחרור מופלאים מאין כמותם.
  <br />
  אז היא משפיעה על הגוף שגם חוזר לחיות, שחרור וזרימה.
  <br />
  <span class="highlight">פתאום</span> רואים את המציאות אחרת
  <br />
  <span class="highlight">פתאום</span> ההריון כבר לא נראה כל כך רחוק
  <br />
  <span class="highlight">פתאום</span> ההריון כבר לא תופס את כל המקום במכלול החיים שלך
  <br />
  <span class="highlight">פתאום</span> יש חיים!
  </p>

  <h4>חלק מעקרונות השיטה איתה אני עובדת:</h4>
  <ul>
  <li>עין טובה</li>
  בגישה של אימון יהודי הבסיס הוא מרחב של כף זכות שדרכו ניתן לגשת לכל התהליך מתוך ראייה שיש כאן רצון טוב, אדם טוב ומכוח הטוב צומחים יותר מהר ובקלות.
  <li>עקב בצד אגודל</li>
  השיטה מחשיבה גם את הדרך אל המטרה וגם את המטרה בעצמה. כך אנחנו לומדות להוקיר כל צעד קטן בדרך בלי להתפתות לצעדים גדולים ודרסטיים. לשמוח מעצם ההתקדמות.
  <li>שיתוף עמוק ושיתוף רוחבי</li>
  ההחלטה לצאת ממחבוא הבושה על ידי שיתוף אחרים מרחיבה את מעגל התמיכה שלנו מסביב.
  <li>להיות נוכחת ברגש</li>
  כשאת מרשה לעצמך לבכות כשעצוב וקשה, לשמוח כשטוב, ובכלל, לבטא כל רגש שעובר בפנים, בזמן ובמקום הנכון, את פורקת את המטענים שהצטברו בפנים ובכך לפנות מקום למשהו טוב.
  <li>הקשבה למחשבות הפוריות ולמחשבות החוסמות </li>
  נכיר את המחשבות הפוריות שלך והמחשבות החוסמות. כיצד הן מנהלות אותך וגורמות לך לפעול בצורה שבה את פועלת ולחשוב באופן בו את חושבת. נשים לב לשינוי שמתחיל לצמוח מתוכך דרך ההתפתחות האישית.
  <li>תקשורת זוגית נכונה – בתהליך נקבל כלים לבנות נכון עוגן זוגי, לחזק את הזוגיות ואת היכולת לתמוך אחד בשני בזמן ההמתנה לילד, טיפולי הפוריות וכל הטלטלות.</li>
  </ul>

  <p>
  <span class="highlight start">מתלבטת אם מתאים לך?</span>
  <br />
  צרי קשר ותקבעי שיחת ייעוץ כעת ללא התחייבות וללא תשלום
  <br />
  <span class="highlight start">תכנית הליווי המלאה כוללת:</span>
  <ul>
  <li>15 מפגשים שבועיים</li>
  <li>שיעורי וידיאו והרפיות בדמיון</li>
  <li>ליווי אישי דרך שיחות אישיות</li>
  </ul>
  <br />
  התוכנית הזאת מבוססת על הכשרתי המקצועית כמכוונת ביחד עם ניסיוני האישי והיא ייחודית. את עוברת בה התחדשות וצמיחה פנימית ואמתית בדרך הייחודית לך.
  </p>

  <p>
  בתוכנית הזו את לומדת:
  לנהל חיים יציבים ופוריים גם כשההיריון עדיין בדרך
  להיכנס לטיפולי הפוריות (כשצריך) מתוך רוגע וביטחון
  להאמין מחדש בגוף שלך והיכולת שלו להרות
  לאהוב את מציאות החיים שלך כפי שהיא
  להיכנס להריון קודם מהראש והתודעה
  להרגיש בנוח עם עצמך ועם הזוגיות שלך בכל מצב
  לשים קץ לכעס, לתסכול ולרגשי הנחיתות
  לראות את עצמך ללא השוואה לאחרות
  </p>

  <p>
  ההשתתפות שלך בתכנית המלאה, דרך קבוצה וליווי אישי, תאפשר לך לתת מקום לרגשות, למחשבות, לאמונות ולרצונות שלך. המקום הנפשי המכווץ יתחיל להיפתח ולהשתחרר. ואז כאשר הנפש משוחררת, זה משפיע לטובה על הגוף. אני ממש יכולה לראות את זה קורה כל הזמן אצל נשים שאני מכוונת.
  </p>
  <p>
  הצטרפי לתוכנית הליווי ולגלות איך להיות מי שאת באמת איך לקבל ולאהוב את עצמך כפי שאת, להחזיר את השליטה לחייך, לחוש הקלה ושמחה עם עצמך ובזוגיות שלך שיאפשרו להיריון להגיע מתוך רוגע ושלווה. ולדעת איך לקבל כל תוצאה מבלי "להתרסק".
  </p>
  <p>
  אחריות:
  אני מציעה לך גם אחריות מלאה, אם לאחר שבועיים בתוכנית, לא מתאים לך מאיזושהי סיבה כספך יוחזר לך ללא צורך בהסברים. אני כל כך בטוחה ברווח שלך בתהליך כך שאתן לך גם לבדוק בעצמך.
  </p>

  <p>
  מה עליך לעשות?
  תקבעי כבר עכשיו שיחת ייעוץ ראשונה ללא עלות ולא כל התחייבות.
  התוכנית הבאה מתחילה ב- 25.4, כ"ט ניסן ותתקיים בסטודיו כפרי
  עשי צעד גדול לטובת החיים שלך והצטרפי לתכנית!
  </p>

  <p>
  מחכה לך,
  גלית פרידמן
  הכוונה נשית בדרך להיריון
  </p>
  `
      };
    return Observable.of(key ? data[key] : data);
  }
}
